package ktb.message;

public enum Message {
    // 일반 메시지 영역
    WELCOME_BANNER("""
                ===@@@@@@@@@@@@@@@@@@@===@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@===@@@@@@@
                ===@@@@@@@@@@@@@@@@@@@===@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@===@@@@@@@@@@@@@@@@@@@@@@@@@@@@@===@@@@@@@
                ===@@@@@@@@@@@@@@@@@@@===@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@===@@@@@@@@@@@@@@@@@@@@@@@@@@@@@===@@@@@@@
                ===@@@@@@@@@@==@@@@@@@===@@@@@@@@@@==@@@@@@@@@@===@@@@@@@@===@@@@@@@@@@===@@@@@@@@===@@@@@===@@==@@@
                ===@@@===@@=========@@===@@@===@@=========@@@=======@@@@@=========@@@=======@@@@=======@@@=========@
                ===@@====@==========@@===@@===@@==========@@=========@@@@=========@@=========@@@========@@==========
                ===@====@@===@@@====@@===@====@@===@@@====@@===@@@===@@@@@===@@@@@@@===@@@===@@===@@@====@====@@@===
                =======@@@===@@@@===@@=======@@@===@@@@===@===@@@@===@@@@@===@@@@@@===@@@@@===@===@@@@===@===@@@@===
                ======@@@===@@@@@===@@======@@@===@@@@@===@===@@@@@===@@@@===@@@@@@===========@===@@@@@@@@===@@@@===
                ======@@@===@@@@@===@@======@@@===@@@@@===@===@@@@@===@@@@===@@@@@@===============@@@@@@@@===@@@@===
                =======@@@===@@@@===@@=======@@@===@@@@===@===@@@@===@@@@@===@@@@@@===@@@@@@@@@===@@@@===@===@@@@===
                ===@====@@===@@@====@@===@====@@===@@@====@====@@@===@@@@@====@@===@===@@@@===@===@@@====@===@@@@===
                ===@@====@==========@@===@@====@==========@@=========@@@@@@========@=========@@=========@@===@@@@===
                ===@@====@@=========@@===@@====@@=========@@@=======@@@@@@@=======@@@=======@@@@=======@@@===@@@@===
                ===@@@@===@@====@@==@@===@@@@===@@====@@==@@@@=====@@@@@@@@@@====@@@@@=====@@@@@@@====@@@@===@@@@@==
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                   @   @@@@@@@    @@@@@@@    @@@@@       @@@@@    @@@@@@@   @@@@@@@ @@   @@@@@   @@@@@@@@    @@@@@@@
                         @@@@       @@@@       @@         @@@       @@@         @@         @      @@@         @@@@@@
                          @@         @@         @        @@@         @@          @                 @@          @@@@@
                   @@@@   @    @@@   @    @@@   @@   @@@@@@    @@@   @    @@@    @    @@@    @@@   @@    @@@   @@@@@
                   @@@@   @   @@@@   @   @@@@   @@   @@@@@@   @@@@@  @   @@@@    @   @@@@   @@@@    @   @@@@   @@@@@
                   @@@@   @   @@@@       @@@@@   @   @@@@@@   @@@@@@@@   @@@@    @   @@@@   @@@@@   @   @@@@    @@@@
                   @@@@   @   @@@@       @@@@@   @   @@@@@@   @@@@@@@@   @@@@@   @   @@@@   @@@@@   @   @@@@@   @@@@
                   @@@@   @   @@@@   @   @@@@   @@   @@@@@@   @@@@@  @   @@@@    @   @@@@   @@@@@   @   @@@@   @@@@@
                   @@@@   @    @@@   @    @@@   @@@   @@       @@@   @    @@@    @   @@@@   @@@@@   @    @@@   @@@@@
                          @@         @@         @@@        @         @@          @   @@@@   @@@@@   @          @@@@@
                  @      @@@@       @@@@       @@@@       @@@       @@@         @@   @@@@   @@@@@  @@         @@@@@@
                @ @@    @@@@@@    @@@@@@@     @@@@@@@   @@@@@@    @@@@@@@   @@@@@@@ @@@@@@@@@@@@@@@@@   @    @@@@@@@
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@
                """),
    SEPARATOR("****************************************"),
    EVENT_OPTIONS("""
            발생시킬 이벤트를 입력해주세요
            1. 입실 or 활성화
            2. 퇴실 or 비활성화
            3. 강사 강의 오픈
            4. 강사 면담세션 오픈
            5. 운영진 헬프세션 오픈
            6. Helper Bot 대화세션 오픈
            7. 구성원 현황 확인
            8. 입실 & 활성화 현황 확인
            9. 모든 구성원 입실 & 활성화처리
            0. 금일 KTB 일정 종료
            =====> :\s"""),
    NICKNAME_REQUEST("누구신가요? 닉네임을 알려주세요.\n====> : "),
    CLOSING_TEMPLATE("%s 일정을 마무리 합니다. 모두 고생 많으셨습니다!\nGROW TOGETHER - KTB\n"),
    KTB_EXPLAIN_TEMPLATE("%s: KTB는 '성장가능성, 기본기, 몰입, 협업'을 강조하며 교육생들의 폭발적 성장을 지원합니다."),
    HUMAN_GREETING_TEMPLATE("%s: 안녕하세요. %s 입니다. 제 본명은 %s이고, 나이는 %d살 이며, %s 입니다."),

    // Template 형식 메시지 영역
    GREETING_TEMPLATE("GROW TOGETHER! - KTB에 오신 것을 환영합니다.\n%s 일정을 시작합니다.\n"),
    KTB_MEMBERS_HEADER("[ KTB 구성원 현황 ]\n\n"),
    KTB_ENTERED_HEADER("[ KTB 교육장 입실 현황 ]\n\n"),
    KTB_INSTRUCTOR_TEMPLATE("""
            강 사(%d명)
            %-14s %-10s
            %s
            """),
    INSTRUCTOR_INFO_TEMPLATE("%-15s %-10s"),
    KTB_STAFF_TEMPLATE("""
            운영진(%d명)
            %-14s %-10s
            %s
            """),
    STAFF_INFO_TEMPLATE("%-15s %-10s"),
    KTB_BOT_TEMPLATE("""
            BOT(%d명)
            %-14s %-10s
            %s
            """),
    BOT_INFO_TEMPLATE("%-15s %-10s"),
    KTB_TRAINEE_TEMPLATE("""
            교육생(%d명)
            %-14s %-10s
            %s
            """),
    TRAINEE_INFO_TEMPLATE("%-15s %-10s"),
    ALREADY_ENTERED_TEMPLATE("%s는 이미 입실했습니다."),
    NOT_ENTERED_STATUS_TEMPLATE("%s는 입실 상태가 아닙니다."),
    LECTURE_OPEN_TEMPLATE("--> 강사 %s 의 지식 %d 강의가 오픈되었습니다.\n"),
    LECTURE_RESULT_TEMPLATE("--> %d 명의 수강생의 지식이 %d만큼 올랐습니다.\n"),
    START_COUNSEL_TEMPLATE("*** 강사 %s의 면담 세션 오픈!***\n"),
    FINISH_COUNSEL_TEMPLATE("***강사 %s의 면담 세션 종료!***\n"),
    CHECK_COUNSEL_AVAILABLE_TEMPLATE("교육생 %s --> 면담을 위해 강사 %s의 방문을 두드림\n"),
    ACCEPT_COUNSEL_TEMPLATE("강 사 %s -> '교육생 %s 들어오세요'\n"),
    GIVE_UP_COUNSEL_TEMPLATE("교육생 %s --> 기다릴 시간이 없어 면담을 포기하고 자기 자리로 돌아감\n"),
    START_COUNSEL_WITH_STATUS_TEMPLATE("교육생 %s --> 면담시작! (면담 전 Stress : %d)\n"),
    FINISH_COUNSEL_WITH_STATUS_TEMPLATE("교육생 %s --> 면담종료! (면담 후 Stress : %d)\n"),
    START_HELP_SESSION_TEMPLATE("***스태프 %s의 헬프 세션 오픈!***\n"),
    FINISH_HELP_SESSION_TEMPLATE("***스태프 %s의 헬프 세션 종료!***\n"),
    CHECK_HELP_AVAILABLE_TEMPLATE("교육생 %s --> 도움을 위해 스태프 %s의 방문을 두드림\n"),
    ACCEPT_HELP_TEMPLATE("스태프 %s -> '교육생 %s 들어오세요'\n"),
    START_HELP_WITH_STATUS_TEMPLATE("교육생 %s --> 헬프세션 시작! (도움 전 Issue : %d)\n"),
    FINISH_HELP_WITH_STATUS_TEMPLATE("교육생 %s --> 헬프세션 종료! (도움 후 Issue : %d)\n"),
    NOT_ACTIVATED_STATUS_TEMPLATE("Bot %s는 활성화 상태가 아닙니다."),
    START_TALK_SESSION_TEMPLATE("***Bot %s의 대화 세션 오픈!***\n"),
    FINISH_TALK_SESSION_TEMPLATE("***Bot %s의 대화 세션 종료! => 총 %d개의 대화가 있었습니다.***\n"),
    START_TALK_WITH_STATUS_TEMPLATE("교육생 %s --> 대화세션 시작! (도움 전 Issue : %d)\n"),
    FINISH_TALK_WITH_STATUS_TEMPLATE("교육생 %s --> 대화세션 종료! (도움 후 Issue : %d)\n"),

    // Exception 에 사용하는 메시지 영역
    EXCEPTION_NOT_EXIST_EVENT("존재하지 않는 이벤트 입니다."),
    EXCEPTION_INVALID_MEMBER_TYPE("존재할 수 없는 유형의 KTB Member 입니다."),
    EXCEPTION_NOT_KTB_MEMBER("%s는 KTB의 구성원이 아닙니다."),
    EXCEPTION_NO_TRAINEES_FOR_LECTURE("해당 강사의 강의를 수강할 교육생이 없어 강의를 열 수 없습니다."),
    EXCEPTION_NOT_INSTRUCTOR_FOR_LECTURE("%s는 강사가 아니므로 강의를 진행할 수 없습니다."),
    EXCEPTION_INSTRUCTOR_NOT_HERE("강사 %s가 현재 입실상태가 아닙니다"),
    EXCEPTION_NOT_INSTRUCTOR_FOR_COUNSEL("%s는 강사가 아니므로 면담을 진행할 수 없습니다."),
    EXCEPTION_NOT_STAFF_FOR_HELP("%s는 스태프가 아니므로 헬프세션을 진행할 수 없습니다."),
    EXCEPTION_NOT_BOT_FOR_TALK("%s는 Bot 아니므로 대화세션을 진행할 수 없습니다."),
    EXCEPTION_FAILED_TO_LOAD_KTB_MEMBERS("KTB 구성원 정보 로딩 실패!!!");

    private final String message;
    Message(String message) { this.message = message; }
    public String getMessage() { return this.message; }

}
